### 概况
* 基于 NumPy构建的

#### 数据结构
* *Series*：一种类似于一维数组的对象，它由一组数据（各种NumPy数据类型）以及一组与之相关的数据标签（即索引）组成。
* DataFrame

In [1]:
from pandas import Series,DataFrame
import pandas as pd
import numpy as np

In [2]:
obj = Series([4,7,-5,3])

In [3]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [4]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [6]:
# 创建带有一个可以对各个数据点进行标记的索引

obj2 = Series(data=[4,7,-5,3],index=['d','b','a','c'])

In [7]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [8]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [9]:
obj2['a']

-5

In [10]:
obj2['d'] = 6

In [11]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2[['c','a','d']]

c    3
a   -5
d    6
dtype: int64

In [13]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [14]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [17]:
# 可以将Series看成是一个定长的有序字典，因为它是索引值到数据值的一个映射。

'b' in obj2

True

In [18]:
'e' in obj2

False

In [19]:
# 如果数据被存放在一个Python字典中，也可以直接通过这个字典来创建Series

sdata = {"Ohio":35000,'Texas':71000,'Oregon':1,'Utah':5000}

In [20]:
obj3 = Series(sdata)

In [21]:
obj3

Ohio      35000
Oregon        1
Texas     71000
Utah       5000
dtype: int64

In [22]:
states = ['California','Ohio','Oregon','Texas']

In [23]:
obj4 = Series(sdata,index=states)

In [24]:
obj4

California        NaN
Ohio          35000.0
Oregon            1.0
Texas         71000.0
dtype: float64

In [25]:
# NaN = Not a Number
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [26]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [27]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj3

Ohio      35000
Oregon        1
Texas     71000
Utah       5000
dtype: int64

In [29]:
obj4

California        NaN
Ohio          35000.0
Oregon            1.0
Texas         71000.0
dtype: float64

In [30]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon             2.0
Texas         142000.0
Utah               NaN
dtype: float64

In [31]:
obj3

Ohio      35000
Oregon        1
Texas     71000
Utah       5000
dtype: int64

In [32]:
obj4

California        NaN
Ohio          35000.0
Oregon            1.0
Texas         71000.0
dtype: float64

In [33]:
obj3['Utah']

5000

In [34]:
test1 = ['one','two']

In [35]:
test2 = {'one':1000,'two':2000,'three':3000}

In [36]:
test11 = Series(test2)

In [37]:
# 如果传入一个字典，则结果Series中的索引就是原字典的键（有序排列）
test22 = Series(test1)

In [38]:
test11 + test22

one      NaN
three    NaN
two      NaN
0        NaN
1        NaN
dtype: object

In [39]:
test11

one      1000
three    3000
two      2000
dtype: int64

In [40]:
test22

0    one
1    two
dtype: object

In [41]:
# Series  对象本身及其索引都有一个name属性，该属性跟pandas其他的关键功能关系非常密切

obj4.name = 'population'

In [42]:
obj4.index.name = 'state'

In [43]:
obj4

state
California        NaN
Ohio          35000.0
Oregon            1.0
Texas         71000.0
Name: population, dtype: float64

In [44]:
# Series的索引可以通过赋值的方式就地修改

obj.index = ['Bob','Steve','Jeff','Ryan']
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

##### DataFrame的介绍
* 一个表格型的数据结构，含有一组有序的列，每列可以是不同的值类型
* 既有行索引，也有列索引，可以被看作是由Series组成的字典（共用同一个索引）

In [45]:
#构建DataFrame最常用的方法就是直接传入一个由等长列表或NumPy数组组成的字典：

data = {'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],'year':[2000,2001,2002,2001,2002],'pop':[1.5,1.7,3.6,2.4,2.9]}
frame = DataFrame(data)

In [46]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [48]:
# 指定列序列之后，则DataFrame的列就会按照指定顺序进行排列
DataFrame(data,columns=['year','state','pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [51]:
# 如果传入的列在数据中找不到，就会产生NA值
frame2 = DataFrame(data,columns=['year','state','pop','debt'],index=['one','two','three','four','five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [52]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [53]:
# 通过类似字典标记的方式或属性的方式，可以将DataFrame的列获取为一个Series
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [54]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [56]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [57]:
# 列可以通过赋值的方式进行修改
frame2['debt'] = 16.5

In [58]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [63]:
frame2['debt'] = np.arange(5.)

In [64]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [65]:
#如果赋值的是一个Series，就会精确匹配DataFrame的索引，所有的空位都将被缺失值填充
val = Series([-1.2,-1.5,-1.7],index=['two','four','five'])

In [66]:
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [69]:
# 为不存在的列赋值会创建出一个新列，关键字del用于删除列：
frame2['eastern']=frame2.state == 'Ohio'
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [71]:
del frame2['eastern']

In [73]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [77]:
# 如果将嵌套字典传给DataFrame，则外层字典的键将被作为列，内层键将被作为行索引。
pop = {'Nevada':{2001:2.4,2002:2.9},'Ohio':{2000:1.5,2001:1.7,2002:3.6}}

In [78]:
frame3 = DataFrame(pop)

In [79]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [80]:
#也可以对结果进行转置
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [81]:
# 内层字典的键会被合并、排序以形成最终的索引，但是显示指定索引不会出现这样的情况

DataFrame(pop,index=[2001,2002,2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [82]:
# 由Series组成的字典方法类似
pdata ={'Ohio':frame3['Ohio'][:-1],'Nevada':frame3['Nevada'][:2]}

In [83]:
DataFrame(pdata)

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [86]:
frame3.index.name='year'
frame3.columns.name='state'

In [87]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [88]:
# values属性也会以二维ndarray的形式返回DataFrame中的数据
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [89]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

#### 索引对象
* 负责管理轴标签和其他元数据

构建Series或DataFrame时，所用到的任何数组或其他序列的标签都会被转换成一个Index:

In [90]:
obj = Series(range(3),index=['a','b','c'])

In [91]:
index = obj.index

In [92]:
index

Index(['a', 'b', 'c'], dtype='object')

In [93]:
index[1:]

Index(['b', 'c'], dtype='object')

In [94]:
index[0:2:1]

Index(['a', 'b'], dtype='object')

In [100]:
index[0::1]

Index(['a', 'b', 'c'], dtype='object')

In [106]:
# Index对象是不可修改的（immutable）
# index[1]='d'
# 不可修改性使得Index对象在多个数据结构之间安全共享：
index = pd.Index(np.arange(3))
obj2 = Series([1.5,-2.5,0], index = index)

In [107]:
obj2.index is index

True

In [108]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [109]:
'Ohio' in frame3.columns

True

In [110]:
2003 in frame3.index

False

#### Series和DataFrame基本功能

In [111]:
# 重新索引
obj = Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [112]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [115]:
# reindex将会重新排列，如果索引值不在，就引入缺失值
obj2 = obj.reindex(['a','b','c','d','e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [116]:
obj.reindex(['a','b','c','d','e'],fill_value=0)

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [117]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])

In [121]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [125]:
#对于DataFrame，reindex可以修改（行）索引、列、或两个都修改，仅传入一个序列，则会重新索引行
frame = DataFrame(np.arange(9).reshape((3,3)),index=['a','c','d'],
                  columns = ['Ohio','Texas','California'])

In [123]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [126]:
frame2 = frame.reindex(['a','b','c','d'])

In [127]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [128]:
# 使用columns关键字即可重新索引列：
states = ['Texas','Utah','California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [133]:
#也可同时对行和列进行重新索引，而插值智能按行应用（即轴0）
# frame.reindex(index=['a','b','c','d'],method='ffill',columns = states)
frame.ix[['a','b','c','d'],states]

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  This is separate from the ipykernel package so we can avoid doing imports until

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [134]:
obj = Series(np.arange(5.),index=['a','b','c','d','e'])

In [136]:
# drop方法返回的是一个在指定轴上删除了指定值的新对象
new_obj = obj.drop('c')

In [137]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [138]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [139]:
# 对于DataFrame，可以删除任意轴上的索引值：
data = DataFrame(np.arange(16).reshape((4,4)),index=['Ohio','Colorado','Utah','New York'],columns=['one','two','three','four'])

In [140]:
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [142]:
data.drop(['one','two'],axis=1)

          three  four
Ohio          2     3
Colorado      6     7
Utah         10    11
New York     14    15

#### 索引、选取和过滤

In [143]:
obj = Series(np.arange(4.),index=['a','b','c','d'])

In [144]:
obj['b']

1.0

In [145]:
obj[1]

1.0

In [146]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [147]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [148]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [152]:
# 对标签的切片运算与普通的切片运算不同，其末端是包含的
obj['b':'c']

b    5.0
c    5.0
dtype: float64

In [153]:
obj['b':'c'] = 5

In [154]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [157]:
data = DataFrame(np.arange(16).reshape((4,4)),
                 index = ['Ohio','Colorado','Utah','New York'],
                 columns = ['one','two','three','four'])

In [158]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [159]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [160]:
data[['three','one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [161]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [162]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [163]:
# 通过布尔型DataFrame进行索引
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [164]:
data[data<5]=0

In [165]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [171]:
# 索引字段ix，可以通过NumPy式的标记法以及轴标签从DataFrame中选取行和列的子集

data.ix['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [172]:
data.ix[['Colorado','Utah'],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [173]:
data.ix[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [174]:
data.ix[data.three>5,:3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

### 算术运算和数据对齐

In [178]:
s1 = Series([7.3,-2.5,3.4,1.5],index=['a','c','d','e'])
s2 = Series([-2.1,3.6,-1.5,4,3.1],index=['a','c','e','f','g'])

In [179]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [180]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [181]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [184]:
# 对于DataFrame，对齐操作是同时发生在行和列上
df1 = DataFrame(np.arange(9.).reshape((3,3)),columns=list('bcd'),
               index = ['Ohio','Texas','Colorado'])

In [185]:
df2 = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),
               index = ['Utah','Ohio','Texas','Oregon'])

In [186]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [187]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [188]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

### 在算数方法中填充值

In [189]:
df1 = DataFrame(np.arange(12.).reshape((3,4)),columns=list('abcd'))

In [192]:
df2 = DataFrame(np.arange(20.).reshape((4,5)),columns=list('abcde'))

In [193]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [194]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [195]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [199]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [204]:
# 在对Series或DataFrame重新索引时，也可以指定一个填充值：
df1.reindex(columns=df2.columns,fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

### DataFrame和Series之间的运算

In [205]:
# 计算一个二维数组与某某行之间的差
arr = np.arange(12.).reshape((3,4))

In [206]:
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [207]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [208]:
arr - arr[0]

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [209]:
frame = DataFrame(np.arange(12.).reshape((4,3)),columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])

In [211]:
series = frame.ix[0]

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

In [212]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [213]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [214]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [215]:
# 如果某个索引值在DataFrame的列或Series的索引中找不到，则参与运算的两个对象就会被重新索引以形成并集

series2 = Series(range(3),index=['b','e','f'])

In [216]:
frame+series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [217]:
# 如果希望在行上匹配且在列上广播，则必须使用算术运算方法
series3 = frame['d']

In [218]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [219]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [222]:
frame.sub(series3,axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

#### 函数应用和映射

In [223]:
frame = DataFrame(np.random.randn(4,3),columns=list('bde'),
                 index = ['Utah','Ohio','Texas','Oregon'])

In [224]:
frame

               b         d         e
Utah    0.378310  0.427371  0.104966
Ohio   -0.382700 -0.759826 -0.724972
Texas   0.616142  2.646614 -0.327729
Oregon -1.417667 -1.531669 -0.207377

In [225]:
np.abs(frame)

               b         d         e
Utah    0.378310  0.427371  0.104966
Ohio    0.382700  0.759826  0.724972
Texas   0.616142  2.646614  0.327729
Oregon  1.417667  1.531669  0.207377

In [226]:
# 将函数应用到由各列或行所形成的一维数组上。DataFrame的apply方法即可实现此功能

f = lambda x:x.max() - x.min()

In [227]:
frame.apply(f)

b    2.033810
d    4.178282
e    0.829938
dtype: float64

In [228]:
frame.apply(f,axis=1)

Utah      0.322405
Ohio      0.377126
Texas     2.974343
Oregon    1.324291
dtype: float64

In [229]:
# 除标量值外，传递给apply的函数还可以返回有多个值组成的Series：

def f(x):
    return Series([x.min(),x.max()],index=['min','max'])

In [230]:
frame.apply(f)

            b         d         e
min -1.417667 -1.531669 -0.724972
max  0.616142  2.646614  0.104966

In [231]:
# 使用applymap即可得到frame中各个浮点值的格式化字符串

format = lambda x: '%.2f'%x
frame.applymap(format)

            b      d      e
Utah     0.38   0.43   0.10
Ohio    -0.38  -0.76  -0.72
Texas    0.62   2.65  -0.33
Oregon  -1.42  -1.53  -0.21

#### 排序和排名
* 对行或列进行排序，可以使用sort_index方法，它将返回一个已排序的新对象。
* 对于DataFrame，可以根据任意一个轴上的索引进行排序
* 在排序时，任何缺失值默认都会被放到Series的末尾

In [233]:
obj = Series(range(4),index=['d','a','b','c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [234]:
frame = DataFrame(np.arange(8).reshape((2,4)),index=['three','one'],
                 columns = ['d','a','b','c'])

In [236]:
frame

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [237]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [238]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [239]:
# 也可以按照降序排序
frame.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [240]:
# 若要按值对Series进行排序，则可以使用其set_values()方法
obj = Series([4,7,-3,2])

In [243]:
obj.sort_values(ascending=False)

1    7
0    4
3    2
2   -3
dtype: int64

In [244]:
obj = Series([4,np.nan,7,np.nan,-3,2])

In [245]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [250]:
# DataFrame上，可以将一个或多个列的名字传递给by，进行排序

frame = DataFrame({'b':[4,7,-3,2],'a':[0,-1,0,1]})

In [251]:
frame

   a  b
0  0  4
1 -1  7
2  0 -3
3  1  2

In [252]:
frame.sort_index(by='b')

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  """Entry point for launching an IPython kernel.

   a  b
2  0 -3
3  1  2
0  0  4
1 -1  7

In [253]:
# 要根据多个列进行排序，传入名称的列表即可
frame.sort_index(by=['a','b'])

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)

   a  b
1 -1  7
2  0 -3
0  0  4
3  1  2

In [254]:
# rank方法默认是“为各组分配一个平均排名”的方式破坏评级关系
obj = Series([7,-5,7,4,2,0,4])

**average：**

rank 表示在这个数在原来的Series中排第几名，有相同的数，取其排名平均（默认）作为值。

在obj中，4和4的排名是第4名和第五名，取平均得4.5。7和7的排名分别是第六名和第七名，则其排名取平均得6.5

**max：**
取其排名最大值

In [255]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [256]:
# 也可以根据值在原数据中出现的顺序给出排名

obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [257]:
obj.rank(ascending=False,method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [258]:
frame = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],
                   'c':[-2,5,8,-2.5]})

In [259]:
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [260]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

---
#### 带有重复值的轴索引
* 如果某个索引对应多个值，则返回一个Series
* 如果对应单个值，则返回一个标量值
---

In [261]:
obj = Series(range(5),index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [262]:
obj.index.is_unique

False

In [263]:
obj['a']

a    0
a    1
dtype: int32

In [264]:
obj['c']

4

In [269]:
df = DataFrame(np.random.randn(4,3),index=['a','a','b','b'])

In [270]:
df

          0         1         2
a  0.314542  1.799721  0.708838
a -1.070530 -1.098533 -1.097489
b -0.356573 -1.492152 -0.271033
b  1.695505 -0.263760 -0.177030

In [271]:
df.ix['b']

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

          0         1         2
b -0.356573 -1.492152 -0.271033
b  1.695505 -0.263760 -0.177030

#### 汇总和计算描述统计

In [272]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],
               [np.nan,np.nan],[0.75,-1.3]],
               index = ['a','b','c','d'],
               columns = ['one','two'])

In [273]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [274]:
# 调用DataFrame的sum方法将会返回一个含有列小计的Series：
df.sum()

one    9.25
two   -5.80
dtype: float64

In [275]:
# 传入axis=1 将按行进行求和运算：
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [276]:
# NA值将会自动被排除，除非整个切片都是NA，通过skipna选项可以禁用
df.mean(axis=1,skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [277]:
df.idxmax()

one    b
two    d
dtype: object

In [278]:
df.idxmin()

one    d
two    b
dtype: object

In [279]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [280]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [281]:
# 对于非数值型数据，describe会产生另一种汇总统计
obj = Series(['a','a','b','c'] * 4)

In [283]:
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [285]:
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

---

#### 相关系数和协方差

---

In [288]:
import pandas_datareader as web

In [303]:

all_data = {}
for ticker in ['IBM','MSFT','GOOG']:
    all_data[ticker] = web.DataReader(ticker,'quandl','1/1/2014','1/1/2018')

price = DataFrame({tic:data['Adj Close']
                      for tic,data in all_data.items})
volume = DataFrame({tic:data['Volume']
                      for tic,data in all_data.items()})

RemoteDataError: Unable to read URL: https://www.quandl.com/api/v3/datasets/WIKI/IBM.csv?start_date=2014-01-01&end_date=2018-01-01&order=asc
Response Text:
b'code,message\n"QELx01","You have exceeded the anonymous user limit of 50 calls per day. To make more calls today, please register for a free Quandl account and then include your API key with your requests."'

#### 唯一值，值计数以及成员资格
* unique 可以得到Series中的唯一值数组
* 对唯一值数组进行排序，uniques.sort()

In [304]:
obj = Series(['c','a','d','a','a','b','b','c','c'])

In [305]:
uniques = obj.unique()

In [306]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [308]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [309]:
# value_counts 还是一个顶级pandas方法，可用于任何数组或序列：
pd.value_counts(obj.values,sort=False)

d    1
a    3
b    2
c    3
dtype: int64

In [310]:
mask = obj.isin(['b','c'])

In [311]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [312]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [314]:
data = DataFrame({'Qu1':[1,3,4,3,4],
                  'Qu2':[2,3,1,2,3],
                  'Qu3':[1,5,2,4,4]})

In [315]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

SyntaxError: invalid syntax (<ipython-input-323-c3ece0053fda>, line 1)

In [318]:
result = data.apply(pd.value_counts).fillna(21)

In [319]:
result

    Qu1   Qu2   Qu3
1   1.0   1.0   1.0
2  21.0   2.0   1.0
3   2.0   2.0  21.0
4   2.0  21.0   2.0
5  21.0  21.0   1.0

#### 处理缺失数据
NaN(not a number)表示浮点和非浮点数组中的缺失数据

Python中内置的None值也会被当作NA处理

In [324]:
string_data = Series(['aardvark','artichoke',np.nan,'avocado'])

In [325]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [327]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [328]:
string_data[0] = None

In [329]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

#### 滤除缺失数据
* dropna 返回一个仅含非空数据和索引值的Series

In [330]:
from numpy import nan as NA
data = Series([1,NA,3.5,NA,7])

In [331]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [332]:
data = DataFrame([[1,6.5,3],[1,NA,NA],[NA,NA,NA],[NA,6.5,3]])

In [333]:
cleaned = data.dropna()

In [334]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [335]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [336]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [337]:
data[4] = NA

In [338]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [339]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [340]:
df = DataFrame(np.random.randn(7,3))
df.ix[:4,1]=NA
df.ix[:2,2]=NA

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:2: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix

In [341]:
df

          0         1         2
0  0.761273       NaN       NaN
1 -0.586256       NaN       NaN
2 -0.003613       NaN       NaN
3  0.320780       NaN  0.134162
4  0.057134       NaN  0.163689
5  0.033333  0.800961 -0.011248
6 -0.319244  1.133005  1.077894

In [342]:
df.dropna(thresh=3)

          0         1         2
5  0.033333  0.800961 -0.011248
6 -0.319244  1.133005  1.077894

#### 填充缺失数据

In [343]:
df.fillna(0)

          0         1         2
0  0.761273  0.000000  0.000000
1 -0.586256  0.000000  0.000000
2 -0.003613  0.000000  0.000000
3  0.320780  0.000000  0.134162
4  0.057134  0.000000  0.163689
5  0.033333  0.800961 -0.011248
6 -0.319244  1.133005  1.077894

In [347]:
df.fillna({1:0.5,3:-1})

          0         1         2
0  0.761273  0.500000       NaN
1 -0.586256  0.500000       NaN
2 -0.003613  0.500000       NaN
3  0.320780  0.500000  0.134162
4  0.057134  0.500000  0.163689
5  0.033333  0.800961 -0.011248
6 -0.319244  1.133005  1.077894

In [348]:
#fillna默认会返回新对象，但也可以对现有对象进行就地修改

_ = df.fillna(0,inplace=True)

In [349]:
df

          0         1         2
0  0.761273  0.000000  0.000000
1 -0.586256  0.000000  0.000000
2 -0.003613  0.000000  0.000000
3  0.320780  0.000000  0.134162
4  0.057134  0.000000  0.163689
5  0.033333  0.800961 -0.011248
6 -0.319244  1.133005  1.077894

In [350]:
df = DataFrame(np.random.randn(6,3))

In [351]:
df.ix[2:,1]=NA
df.ix[4:,2]=NA

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

In [352]:
 df

          0         1         2
0  0.239071  0.717502  0.951667
1  1.462397  0.166147 -0.033153
2 -1.703601       NaN -0.772439
3  0.409546       NaN -0.693116
4 -0.451748       NaN       NaN
5 -0.925912       NaN       NaN

In [353]:
df.fillna(method='ffill')

          0         1         2
0  0.239071  0.717502  0.951667
1  1.462397  0.166147 -0.033153
2 -1.703601  0.166147 -0.772439
3  0.409546  0.166147 -0.693116
4 -0.451748  0.166147 -0.693116
5 -0.925912  0.166147 -0.693116

In [354]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.239071  0.717502  0.951667
1  1.462397  0.166147 -0.033153
2 -1.703601  0.166147 -0.772439
3  0.409546  0.166147 -0.693116
4 -0.451748       NaN -0.693116
5 -0.925912       NaN -0.693116

---
层次化索引

---

In [356]:
data = Series(np.random.randn(10),index=[['a','a','a','b','b','b','c','c','d','d'],

                                         [1,2,3,1,2,3,1,2,2,3]])

In [357]:
data

a  1   -1.816666
   2    0.892891
   3    0.217596
b  1   -0.012338
   2    0.503548
   3   -0.239301
c  1   -0.358118
   2   -0.572663
d  2    0.165715
   3   -0.066789
dtype: float64

In [360]:
data.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [361]:
data['b']

1   -0.012338
2    0.503548
3   -0.239301
dtype: float64

In [362]:
data['b':'c']

b  1   -0.012338
   2    0.503548
   3   -0.239301
c  1   -0.358118
   2   -0.572663
dtype: float64

In [363]:
data.ix[['b','d']]

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

b  1   -0.012338
   2    0.503548
   3   -0.239301
d  2    0.165715
   3   -0.066789
dtype: float64

In [370]:
data[:,3]

a    0.217596
b   -0.239301
d   -0.066789
dtype: float64

In [371]:
data.unstack()

          1         2         3
a -1.816666  0.892891  0.217596
b -0.012338  0.503548 -0.239301
c -0.358118 -0.572663       NaN
d       NaN  0.165715 -0.066789

In [372]:
# 对于一个DataFrame,每条轴都可以有分层索引

frame = DataFrame(np.arange(12).reshape((4,3)),
                 index = [['a','a','b','b'],[1,2,1,2]],
                 columns = [['Ohio','Ohio','Colorado'],['Green','Red','Green']])

In [373]:
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [375]:
frame.index.names = ['key1','key2']
frame.columns.names = ['state','color']

In [376]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [377]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### 重新分级排序

In [379]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [389]:
# sortlevel根据单个级别中的值对数据进行排序（稳定的）

frame.sortlevel(-2)

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:3: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  This is separate from the ipykernel package so we can avoid doing imports until

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [390]:
frame.swaplevel(0,1).sortlevel(0)

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

In [391]:
frame.sortlevel(0)

G:\Program Files\Anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: sortlevel is deprecated, use sort_index(level= ...)
  """Entry point for launching an IPython kernel.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

#### 根据级别汇总统计

In [392]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [393]:
frame.sum(level='color',axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

#### 使用DataFrame的列

In [399]:
frame = DataFrame({'a':range(7),'b':range(7,0,-1),
                   'c':['one','one','one','two','two','two','two'],
                   'd':[0,1,2,0,1,2,3]})

In [400]:
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [401]:
frame22 = frame.set_index(['c','d'])

In [402]:
frame22

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [403]:
# 默认情况下，被转为行索引的一个或多个列会被移除，但也可以将其保留下来
frame.set_index(['c','d'],drop=False)

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [406]:
# reset_index与set_index相反，层次化索引的级别会被转移到列里面：
frame22.reset_index()

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

In [410]:
frame22['a']

c    d
one  0    0
     1    1
     2    2
two  0    3
     1    4
     2    5
     3    6
Name: a, dtype: int32

In [412]:
frame22.shape

(7, 2)